Revit 2027 API
ElementRecord.WorksetId Property
 Get Id of the workset which owns the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WorksetId WorksetId { get; }
Public ReadOnly Property WorksetId As WorksetId
	Get
public:
property WorksetId^ WorksetId {
	WorksetId^ get ();
}
member WorksetId : WorksetId with get
Property Value
WorksetId
Remarks
 Each element belongs to one and only one workset.
See Also
Reference
ElementRecord Class
Autodesk.Revit.DB Namespace